const homeworkData = [
    {
        "id": "8392",
        "grade": 3,
        "subject": "הנדסה",
        "task": "לגזור מעמוד 207 - דף מצולעים לגזירה לפרק מרובעים",
        "date": "18/02"
    },
    {
        "id": "8795",
        "grade": 3,
        "subject": "הנדסה",
        "task": "יש לגזור את המשולשים והמרובעים מעמוד 207 כפי שביקשתי בשיעור קודם ולהדביקם בעמוד 95. ",
        "date": "25/02"
    },
    {
        "id": "8404",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 33",
        "date": "18/02"
    },
    {
        "id": "8634",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 63",
        "date": "23/02"
    },
    {
        "id": "8822",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום עמ '135-136",
        "date": "25/02"
    },
    {
        "id": "8852",
        "grade": 3,
        "subject": "כתיבה",
        "task": "מי שלא סיים  -יש להביא לי לבדיקה ביום שישי.",
        "date": "25/02"
    },
    {
        "id": "8534",
        "grade": 3,
        "subject": "לשון",
        "task": "סיום עמ '68-69",
        "date": "20/02"
    },
    {
        "id": "8981",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 107 שאלות 1-4 לענות במחברת. ליום שישי",
        "date": "27/02"
    },
    {
        "id": "8407",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמ' 149",
        "date": "18/02"
    },
    {
        "id": "8834",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף עבודה בנושא המגילה - להחזיר לבדיקה ביום שישי",
        "date": "25/02"
    },
    {
        "id": "8676",
        "grade": 3,
        "subject": "תורה",
        "task": "1. לאן ציווה ה'? על יעקב ללכת ומה הוא ביקש ממנו לבנות שם?\n2. מה יעקב ביקש מבני ביתו לעושת לפני שהלכו לבית אל?\n3. מה עשה יעקב עם כל הפסלים והתכשיטים?\n4. איך קרא יעקב למקום ומדוע?",
        "date": "23/02"
    },
    {
        "id": "8677",
        "grade": 3,
        "subject": "תורה",
        "task": "1. לאן ציווה ה'? על יעקב ללכת ומה הוא ביקש ממנו לבנות שם?\n2. מה יעקב ביקש מבני ביתו לעושת לפני שהלכו לבית אל?\n3. מה עשה יעקב עם כל הפסלים והתכשיטים?\n4. איך קרא יעקב למקום ומדוע?",
        "date": "23/02"
    },
    {
        "id": "8729",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 96",
        "date": "24/02"
    },
    {
        "id": "8458",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "36-41",
        "date": "19/02"
    }
];