const homeworkData = [
    {
        "id": "10514",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 167",
        "date": "27/04"
    },
    {
        "id": "10554",
        "grade": 3,
        "subject": "חשבון",
        "task": "יש לסיים עד עמוד 172",
        "date": "28/04"
    },
    {
        "id": "10830",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 8",
        "date": "04/05"
    },
    {
        "id": "10918",
        "grade": 3,
        "subject": "חשבון",
        "task": "יש לסיים עד עמוד 14 כולל",
        "date": "06/05"
    },
    {
        "id": "11125",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 25",
        "date": "11/05"
    },
    {
        "id": "11434",
        "grade": 3,
        "subject": "חשבון",
        "task": "מי שלא סיים, יש לסיים עד עמוד 40 כולל.",
        "date": "17/05"
    },
    {
        "id": "11435",
        "grade": 3,
        "subject": "חשבון",
        "task": "מי שלא סיים, יש לסיים עד עמוד 40 כולל.",
        "date": "17/05"
    },
    {
        "id": "11577",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 52",
        "date": "19/05"
    },
    {
        "id": "11349",
        "grade": 3,
        "subject": "לשון",
        "task": "סיום עמ' 116-118",
        "date": "15/05"
    },
    {
        "id": "10377",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 131 לסיים בבית",
        "date": "24/04"
    },
    {
        "id": "10799",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 138",
        "date": "03/05"
    },
    {
        "id": "11557",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים עד עמוד 52",
        "date": "19/05"
    },
    {
        "id": "11558",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים עד עמוד 52",
        "date": "19/05"
    },
    {
        "id": "10389",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום השאלות - עמ '105",
        "date": "24/04"
    },
    {
        "id": "10772",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף העבודה - מי שלא בדקתי לו יש להביא מחר לבדיקה",
        "date": "03/05"
    },
    {
        "id": "10773",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף העבודה - מי שלא בדקתי לו יש להביא מחר לבדיקה",
        "date": "03/05"
    },
    {
        "id": "11047",
        "grade": 3,
        "subject": "שפה",
        "task": "לסיים שאלות במחברת: 1. כתבו 2 שאלות שהייתם רוצים לשאול את באטר. 2. כתבו 5 עובדו שלמדתם על באטר מהטקסט.",
        "date": "10/05"
    },
    {
        "id": "11048",
        "grade": 3,
        "subject": "שפה",
        "task": "לסיים שאלות במחברת: 1. כתבו 2 שאלות שהייתם רוצים לשאול את באטר. 2. כתבו 5 עובדו שלמדתם על באטר מהטקסט.",
        "date": "10/05"
    },
    {
        "id": "11500",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף עבודה",
        "date": "18/05"
    },
    {
        "id": "11556",
        "grade": 3,
        "subject": "שפה",
        "task": "יש לסיים את הדף ולהביא לבדיקה מחר",
        "date": "19/05"
    },
    {
        "id": "10438",
        "grade": 5,
        "subject": "אנגלית",
        "task": "p. 124 ללמוד את המילים להכתבה",
        "date": "26/04"
    },
    {
        "id": "11084",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p.125, 126",
        "date": "10/05"
    },
    {
        "id": "10942",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "עד עמוד 81",
        "date": "07/05"
    },
    {
        "id": "11296",
        "grade": 5,
        "subject": "לשון",
        "task": "ע\"מ 220",
        "date": "14/05"
    },
    {
        "id": "10728",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת עד עמוד 150",
        "date": "01/05"
    },
    {
        "id": "10916",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת 159-162",
        "date": "06/05"
    },
    {
        "id": "11198",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת",
        "date": "12/05"
    },
    {
        "id": "11415",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים מתאימים",
        "date": "17/05"
    },
    {
        "id": "11032",
        "grade": 5,
        "subject": "תרבות ישראל",
        "task": "208-211",
        "date": "08/05"
    }
];