const homeworkData = [
    {
        "id": "11434",
        "grade": 3,
        "subject": "חשבון",
        "task": "מי שלא סיים, יש לסיים עד עמוד 40 כולל.",
        "date": "17/05"
    },
    {
        "id": "11435",
        "grade": 3,
        "subject": "חשבון",
        "task": "מי שלא סיים, יש לסיים עד עמוד 40 כולל.",
        "date": "17/05"
    },
    {
        "id": "11577",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 52",
        "date": "19/05"
    },
    {
        "id": "11726",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום המשימות. הרוב נעשה ונבדק בכיתה.",
        "date": "25/05"
    },
    {
        "id": "12118",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 121",
        "date": "02/06"
    },
    {
        "id": "12170",
        "grade": 3,
        "subject": "חשבון",
        "task": "יש לסיים עד עמ' 69",
        "date": "03/06"
    },
    {
        "id": "12345",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 76",
        "date": "07/06"
    },
    {
        "id": "12346",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 76",
        "date": "07/06"
    },
    {
        "id": "12443",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 81-85",
        "date": "10/06"
    },
    {
        "id": "11349",
        "grade": 3,
        "subject": "לשון",
        "task": "סיום עמ' 116-118",
        "date": "15/05"
    },
    {
        "id": "11669",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 161 שאלות 1-3 בלבד",
        "date": "24/05"
    },
    {
        "id": "11770",
        "grade": 3,
        "subject": "מדעים",
        "task": "התלמידים קיבלו את המבחנים בחזרה",
        "date": "26/05"
    },
    {
        "id": "12291",
        "grade": 3,
        "subject": "מדעים",
        "task": "מי שלא הגיע מתבקש להשלים.",
        "date": "05/06"
    },
    {
        "id": "12630",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 182, מה שעשינו בכיתה. לא להתקדם.",
        "date": "14/06"
    },
    {
        "id": "11557",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים עד עמוד 52",
        "date": "19/05"
    },
    {
        "id": "11558",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים עד עמוד 52",
        "date": "19/05"
    },
    {
        "id": "11500",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף עבודה",
        "date": "18/05"
    },
    {
        "id": "11556",
        "grade": 3,
        "subject": "שפה",
        "task": "יש לסיים את הדף ולהביא לבדיקה מחר",
        "date": "19/05"
    },
    {
        "id": "12199",
        "grade": 3,
        "subject": "שפה",
        "task": "שאלות בעמוד 205",
        "date": "03/06"
    },
    {
        "id": "11893",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 139-141",
        "date": "28/05"
    },
    {
        "id": "12211",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "89-93",
        "date": "04/06"
    },
    {
        "id": "12510",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "89-95",
        "date": "11/06"
    },
    {
        "id": "11415",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת עמודים מתאימים",
        "date": "17/05"
    },
    {
        "id": "11936",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "6-11 בחוברת מס' 15",
        "date": "29/05"
    },
    {
        "id": "12612",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "עד עמוד 132",
        "date": "14/06"
    },
    {
        "id": "11956",
        "grade": 5,
        "subject": "שפה",
        "task": "עמוד 230",
        "date": "31/05"
    },
    {
        "id": "11957",
        "grade": 5,
        "subject": "שפה",
        "task": "עמוד 230",
        "date": "31/05"
    }
];