const homeworkData = [
    {
        "id": "8392",
        "grade": 3,
        "subject": "הנדסה",
        "task": "לגזור מעמוד 207 - דף מצולעים לגזירה לפרק מרובעים",
        "date": "18/02"
    },
    {
        "id": "8227",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 127",
        "date": "16/02"
    },
    {
        "id": "8404",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 33",
        "date": "18/02"
    },
    {
        "id": "8634",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 63",
        "date": "23/02"
    },
    {
        "id": "8534",
        "grade": 3,
        "subject": "לשון",
        "task": "סיום עמ '68-69",
        "date": "20/02"
    },
    {
        "id": "8327",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 96-97 ",
        "date": "17/02"
    },
    {
        "id": "8314",
        "grade": 3,
        "subject": "מולדת",
        "task": "שרטט את החדר שלך לפי הנלמד",
        "date": "17/02"
    },
    {
        "id": "8319",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים עמ' 146-147",
        "date": "17/02"
    },
    {
        "id": "8320",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים עמ' 146-147",
        "date": "17/02"
    },
    {
        "id": "8407",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמ' 149",
        "date": "18/02"
    },
    {
        "id": "8676",
        "grade": 3,
        "subject": "תורה",
        "task": "1. לאן ציווה ה'? על יעקב ללכת ומה הוא ביקש ממנו לבנות שם?\n2. מה יעקב ביקש מבני ביתו לעושת לפני שהלכו לבית אל?\n3. מה עשה יעקב עם כל הפסלים והתכשיטים?\n4. איך קרא יעקב למקום ומדוע?",
        "date": "23/02"
    },
    {
        "id": "8677",
        "grade": 3,
        "subject": "תורה",
        "task": "1. לאן ציווה ה'? על יעקב ללכת ומה הוא ביקש ממנו לבנות שם?\n2. מה יעקב ביקש מבני ביתו לעושת לפני שהלכו לבית אל?\n3. מה עשה יעקב עם כל הפסלים והתכשיטים?\n4. איך קרא יעקב למקום ומדוע?",
        "date": "23/02"
    },
    {
        "id": "8345",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 92, 94(1)",
        "date": "17/02"
    },
    {
        "id": "8729",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 96",
        "date": "24/02"
    },
    {
        "id": "8458",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "36-41",
        "date": "19/02"
    },
    {
        "id": "8248",
        "grade": 5,
        "subject": "מדעים",
        "task": "294-295",
        "date": "16/02"
    },
    {
        "id": "8181",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "81-83",
        "date": "15/02"
    },
    {
        "id": "8344",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "84-87",
        "date": "17/02"
    },
    {
        "id": "8295",
        "grade": 5,
        "subject": "תנ\"ך - גיאוגרפיה",
        "task": "עמודים 206-207",
        "date": "17/02"
    }
];