const homeworkData = [
    {
        "id": "13052",
        "grade": 3,
        "subject": "הנדסה",
        "task": "יש לסיים עד עמ' 128",
        "date": "24/06"
    },
    {
        "id": "12118",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 121",
        "date": "02/06"
    },
    {
        "id": "12170",
        "grade": 3,
        "subject": "חשבון",
        "task": "יש לסיים עד עמ' 69",
        "date": "03/06"
    },
    {
        "id": "12345",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 76",
        "date": "07/06"
    },
    {
        "id": "12346",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 76",
        "date": "07/06"
    },
    {
        "id": "12443",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 81-85",
        "date": "10/06"
    },
    {
        "id": "12701",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 127",
        "date": "15/06"
    },
    {
        "id": "12746",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 98",
        "date": "16/06"
    },
    {
        "id": "12951",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 168",
        "date": "22/06"
    },
    {
        "id": "13028",
        "grade": 3,
        "subject": "חשבון",
        "task": "יש לסיים עד עמ' 178",
        "date": "23/06"
    },
    {
        "id": "13066",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 132",
        "date": "24/06"
    },
    {
        "id": "12291",
        "grade": 3,
        "subject": "מדעים",
        "task": "מי שלא הגיע מתבקש להשלים.",
        "date": "05/06"
    },
    {
        "id": "12630",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 182, מה שעשינו בכיתה. לא להתקדם.",
        "date": "14/06"
    },
    {
        "id": "13121",
        "grade": 3,
        "subject": "מדעים",
        "task": "הפעילות היתה מקסימה והמצגת מושקעת מאוד. כל הכבוד לאריאל ואורי על שיעור מעשיר, מעניין ויצירתי מאוד. תודה רבה.",
        "date": "26/06"
    },
    {
        "id": "12199",
        "grade": 3,
        "subject": "שפה",
        "task": "שאלות בעמוד 205",
        "date": "03/06"
    },
    {
        "id": "11893",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 139-141",
        "date": "28/05"
    },
    {
        "id": "12211",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "89-93",
        "date": "04/06"
    },
    {
        "id": "12510",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "89-95",
        "date": "11/06"
    },
    {
        "id": "12839",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "137-142",
        "date": "18/06"
    },
    {
        "id": "13079",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "155-157",
        "date": "25/06"
    },
    {
        "id": "12656",
        "grade": 5,
        "subject": "כתיבה",
        "task": "עמוד 271",
        "date": "15/06"
    },
    {
        "id": "11936",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "6-11 בחוברת מס' 15",
        "date": "29/05"
    },
    {
        "id": "12612",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "עד עמוד 132",
        "date": "14/06"
    },
    {
        "id": "12751",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "עד עמוד 137 כולל",
        "date": "16/06"
    },
    {
        "id": "11956",
        "grade": 5,
        "subject": "שפה",
        "task": "עמוד 230",
        "date": "31/05"
    },
    {
        "id": "11957",
        "grade": 5,
        "subject": "שפה",
        "task": "עמוד 230",
        "date": "31/05"
    }
];