const homeworkData = [
    {
        "id": "7005",
        "grade": 3,
        "subject": "אנגלית",
        "task": "193",
        "date": "25/01"
    },
    {
        "id": "5659",
        "grade": 3,
        "subject": "הנדסה",
        "task": "יש להביא לשיעור מארז אביזרים כולל אוסף זוויות",
        "date": "30/12"
    },
    {
        "id": "6107",
        "grade": 3,
        "subject": "הנדסה",
        "task": "סיום עמ' 42",
        "date": "07/01"
    },
    {
        "id": "5730",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד 190 - מי שלא סיים",
        "date": "31/12"
    },
    {
        "id": "5970",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 204- ילדים שסיימו השאירו את החוברת בכיתה. \nנא להביא מחר את חוברת 7 שתישאר בכיתה וכן את חוברת 8 .",
        "date": "05/01"
    },
    {
        "id": "6674",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום משימות בכיתה עד עמ' 89 כולל - מי שלא סיים",
        "date": "19/01"
    },
    {
        "id": "7031",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 41 ",
        "date": "25/01"
    },
    {
        "id": "7032",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 41 ",
        "date": "25/01"
    },
    {
        "id": "6356",
        "grade": 3,
        "subject": "לשון",
        "task": "בחרו 3 מילים שפירשנו מתוך הטקסט וחברו משפט לכל מילה.",
        "date": "12/01"
    },
    {
        "id": "5951",
        "grade": 3,
        "subject": "מדעים",
        "task": "התלמידים קיבלו את המבחנים בחזרה",
        "date": "04/01"
    },
    {
        "id": "6286",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 70שאלה 1",
        "date": "11/01"
    },
    {
        "id": "6959",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמודים 78-79 \nשאלות 1-2 בעמוד 78 )רשימה של 10 מוצרי חשמל ולאיזו מטרה משתמשים בו?",
        "date": "23/01"
    },
    {
        "id": "6077",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום המשימות בעמוד 41",
        "date": "06/01"
    },
    {
        "id": "6078",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום המשימות בעמוד 41",
        "date": "06/01"
    },
    {
        "id": "7155",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "יש לסיים את עמוד 50 - לכתוב מכתב ולהביא אותו בבקבוק פלסטיק חד פעמי לכיתה - למחר.",
        "date": "27/01"
    },
    {
        "id": "7156",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "יש לסיים את עמוד 50 - לכתוב מכתב ולהביא אותו בבקבוק פלסטיק חד פעמי לכיתה - למחר.",
        "date": "27/01"
    },
    {
        "id": "5873",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום המשימות עד עמ' 38 משימה 7 כולל במחברת",
        "date": "02/01"
    },
    {
        "id": "6821",
        "grade": 3,
        "subject": "שפה",
        "task": "משימה נוספת במחברת - כתבו 5 מילים מתארות למילה מסע.",
        "date": "21/01"
    },
    {
        "id": "6977",
        "grade": 3,
        "subject": "שפה",
        "task": "ש\"ב במחברת: כתבו מעל כל משפט מה הסיבה ומה התוצאה:\n1. לא שתיתי מים ולכן כאב לי הראש.\n2. הלכתי לישון מאוחר ואיחרתי לבית הספר.\n3. נפלתי מהאופניים כי רכבתי מהר.\n4. לא הרגשתי טוב ולכן שתיתי תרופה.",
        "date": "25/01"
    },
    {
        "id": "6978",
        "grade": 3,
        "subject": "שפה",
        "task": "ש\"ב במחברת: כתבו מעל כל משפט מה הסיבה ומה התוצאה:\n1. לא שתיתי מים ולכן כאב לי הראש.\n2. הלכתי לישון מאוחר ואיחרתי לבית הספר.\n3. נפלתי מהאופניים כי רכבתי מהר.\n4. לא הרגשתי טוב ולכן שתיתי תרופה.",
        "date": "25/01"
    },
    {
        "id": "7224",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמוד 52 שאלות 1-3",
        "date": "28/01"
    },
    {
        "id": "7084",
        "grade": 3,
        "subject": "תורה",
        "task": "מבחן יתקיים ב 16.2.26",
        "date": "26/01"
    },
    {
        "id": "7085",
        "grade": 3,
        "subject": "תורה",
        "task": "מבחן יתקיים ב 16.2.26",
        "date": "26/01"
    },
    {
        "id": "6029",
        "grade": 3,
        "subject": "תרבות ישראל",
        "task": "סיום שאלה 4 במחברת - כתבו על מקרה בו עזרתם לחבר או קיבלתם עזרה מחבר",
        "date": "06/01"
    },
    {
        "id": "5710",
        "grade": 5,
        "subject": "אנגלית",
        "task": "משימה באתר גלים",
        "date": "30/12"
    },
    {
        "id": "5836",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 61-63",
        "date": "01/01"
    },
    {
        "id": "6044",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 64-65",
        "date": "06/01"
    },
    {
        "id": "6188",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 64, 65, 66, ex. 4",
        "date": "08/01"
    },
    {
        "id": "6409",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 66-68",
        "date": "13/01"
    },
    {
        "id": "7030",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 74-76",
        "date": "25/01"
    },
    {
        "id": "7256",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 79-80",
        "date": "29/01"
    },
    {
        "id": "5806",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "בחוברת עמודים 24-33 כולל",
        "date": "01/01"
    },
    {
        "id": "6870",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "34-35- חקירת מקביליות מיוחדות",
        "date": "22/01"
    },
    {
        "id": "5703",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "184-187",
        "date": "30/12"
    },
    {
        "id": "5810",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "187-191",
        "date": "31/12"
    },
    {
        "id": "6297",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "4-7",
        "date": "11/01"
    },
    {
        "id": "6422",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "8-13",
        "date": "13/01"
    },
    {
        "id": "6559",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "8-13",
        "date": "14/01"
    },
    {
        "id": "6633",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "18-24 כולל",
        "date": "18/01"
    },
    {
        "id": "6850",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת",
        "date": "21/01"
    },
    {
        "id": "6952",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת",
        "date": "23/01"
    },
    {
        "id": "7016",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "41-45",
        "date": "25/01"
    },
    {
        "id": "7241",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "במחברת",
        "date": "28/01"
    },
    {
        "id": "6606",
        "grade": 5,
        "subject": "שפה",
        "task": "110-113",
        "date": "18/01"
    },
    {
        "id": "6607",
        "grade": 5,
        "subject": "שפה",
        "task": "110-113",
        "date": "18/01"
    }
];