const homeworkData = [
    {
        "id": "9960",
        "grade": 3,
        "subject": "הנדסה",
        "task": "סיום עמ' 99",
        "date": "15/04"
    },
    {
        "id": "9769",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 71 כולל",
        "date": "12/04"
    },
    {
        "id": "9770",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 71 כולל",
        "date": "12/04"
    },
    {
        "id": "9839",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 150",
        "date": "13/04"
    },
    {
        "id": "9991",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 75 כולל.",
        "date": "15/04"
    },
    {
        "id": "10514",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 167",
        "date": "27/04"
    },
    {
        "id": "10554",
        "grade": 3,
        "subject": "חשבון",
        "task": "יש לסיים עד עמוד 172",
        "date": "28/04"
    },
    {
        "id": "10830",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 8",
        "date": "04/05"
    },
    {
        "id": "10918",
        "grade": 3,
        "subject": "חשבון",
        "task": "יש לסיים עד עמוד 14 כולל",
        "date": "06/05"
    },
    {
        "id": "10182",
        "grade": 3,
        "subject": "לשון",
        "task": "לסיים עמ' 155-159",
        "date": "20/04"
    },
    {
        "id": "10377",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 131 לסיים בבית",
        "date": "24/04"
    },
    {
        "id": "10799",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 138",
        "date": "03/05"
    },
    {
        "id": "9921",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום שאלה 2 בלבד",
        "date": "14/04"
    },
    {
        "id": "9922",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום שאלה 2 בלבד",
        "date": "14/04"
    },
    {
        "id": "10087",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמ' 229-230 - שאלות 1-5",
        "date": "19/04"
    },
    {
        "id": "10088",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמ' 229-230 - שאלות 1-5",
        "date": "19/04"
    },
    {
        "id": "10389",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום השאלות - עמ '105",
        "date": "24/04"
    },
    {
        "id": "10772",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף העבודה - מי שלא בדקתי לו יש להביא מחר לבדיקה",
        "date": "03/05"
    },
    {
        "id": "10773",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף העבודה - מי שלא בדקתי לו יש להביא מחר לבדיקה",
        "date": "03/05"
    },
    {
        "id": "11047",
        "grade": 3,
        "subject": "שפה",
        "task": "לסיים שאלות במחברת: 1. כתבו 2 שאלות שהייתם רוצים לשאול את באטר. 2. כתבו 5 עובדו שלמדתם על באטר מהטקסט.",
        "date": "10/05"
    },
    {
        "id": "11048",
        "grade": 3,
        "subject": "שפה",
        "task": "לסיים שאלות במחברת: 1. כתבו 2 שאלות שהייתם רוצים לשאול את באטר. 2. כתבו 5 עובדו שלמדתם על באטר מהטקסט.",
        "date": "10/05"
    },
    {
        "id": "10438",
        "grade": 5,
        "subject": "אנגלית",
        "task": "p. 124 ללמוד את המילים להכתבה",
        "date": "26/04"
    },
    {
        "id": "11084",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p.125, 126",
        "date": "10/05"
    },
    {
        "id": "10021",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "בחוברת 52-53",
        "date": "16/04"
    },
    {
        "id": "10942",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "עד עמוד 81",
        "date": "07/05"
    },
    {
        "id": "10728",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת עד עמוד 150",
        "date": "01/05"
    },
    {
        "id": "10916",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת 159-162",
        "date": "06/05"
    },
    {
        "id": "11032",
        "grade": 5,
        "subject": "תרבות ישראל",
        "task": "208-211",
        "date": "08/05"
    }
];