const homeworkData = [
    {
        "id": "9046",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 141-142",
        "date": "08/03"
    },
    {
        "id": "8981",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 107 שאלות 1-4 לענות במחברת. ליום שישי",
        "date": "27/02"
    },
    {
        "id": "9045",
        "grade": 3,
        "subject": "שפה",
        "task": "עמ' 90-91-משימות 1-6",
        "date": "08/03"
    },
    {
        "id": "9061",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 104-105",
        "date": "08/03"
    }
];