const homeworkData = [
    {
        "id": "7984",
        "grade": 3,
        "subject": "הנדסה",
        "task": "סיום עמ' 91",
        "date": "11/02"
    },
    {
        "id": "7605",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד 113",
        "date": "04/02"
    },
    {
        "id": "7804",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 54",
        "date": "08/02"
    },
    {
        "id": "7805",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 54",
        "date": "08/02"
    },
    {
        "id": "7823",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 117",
        "date": "09/02"
    },
    {
        "id": "8007",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום עמ' 121-122",
        "date": "11/02"
    },
    {
        "id": "8030",
        "grade": 3,
        "subject": "כתיבה",
        "task": "דפי עבודה בנושא משפחות מילים שניתנו כמשימה הנוספת בשיעור.",
        "date": "11/02"
    },
    {
        "id": "7721",
        "grade": 3,
        "subject": "לשון",
        "task": "סיום עמודים 45-47 משימות 1-3",
        "date": "06/02"
    },
    {
        "id": "7915",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 87. שאלות 1-3 מי שלא הספיק בכיתה.\nעמוד 94- שאלות 4 ו5 בלבד.",
        "date": "10/02"
    },
    {
        "id": "7955",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום עמוד 63",
        "date": "10/02"
    },
    {
        "id": "7956",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום עמוד 63",
        "date": "10/02"
    },
    {
        "id": "7890",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום משימות בעמוד 61",
        "date": "10/02"
    },
    {
        "id": "7860",
        "grade": 3,
        "subject": "תורה",
        "task": "בשבוע הבא יתקיים מבחן - פרקים כח, כט, לא",
        "date": "09/02"
    },
    {
        "id": "7861",
        "grade": 3,
        "subject": "תורה",
        "task": "בשבוע הבא יתקיים מבחן - פרקים כח, כט, לא",
        "date": "09/02"
    },
    {
        "id": "7886",
        "grade": 3,
        "subject": "תרבות ישראל",
        "task": "סיום משימות בעמוד 61",
        "date": "10/02"
    },
    {
        "id": "8060",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "במחברת",
        "date": "12/02"
    },
    {
        "id": "7795",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "63-67",
        "date": "08/02"
    }
];