const homeworkData = [
    {
        "id": "7984",
        "grade": 3,
        "subject": "הנדסה",
        "task": "סיום עמ' 91",
        "date": "11/02"
    },
    {
        "id": "8392",
        "grade": 3,
        "subject": "הנדסה",
        "task": "לגזור מעמוד 207 - דף מצולעים לגזירה לפרק מרובעים",
        "date": "18/02"
    },
    {
        "id": "7804",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 54",
        "date": "08/02"
    },
    {
        "id": "7805",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 54",
        "date": "08/02"
    },
    {
        "id": "7823",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 117",
        "date": "09/02"
    },
    {
        "id": "8007",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום עמ' 121-122",
        "date": "11/02"
    },
    {
        "id": "8227",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 127",
        "date": "16/02"
    },
    {
        "id": "8404",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 33",
        "date": "18/02"
    },
    {
        "id": "8030",
        "grade": 3,
        "subject": "כתיבה",
        "task": "דפי עבודה בנושא משפחות מילים שניתנו כמשימה הנוספת בשיעור.",
        "date": "11/02"
    },
    {
        "id": "7915",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 87. שאלות 1-3 מי שלא הספיק בכיתה.\nעמוד 94- שאלות 4 ו5 בלבד.",
        "date": "10/02"
    },
    {
        "id": "8327",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 96-97 ",
        "date": "17/02"
    },
    {
        "id": "8314",
        "grade": 3,
        "subject": "מולדת",
        "task": "שרטט את החדר שלך לפי הנלמד",
        "date": "17/02"
    },
    {
        "id": "7955",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום עמוד 63",
        "date": "10/02"
    },
    {
        "id": "7956",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום עמוד 63",
        "date": "10/02"
    },
    {
        "id": "8319",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים עמ' 146-147",
        "date": "17/02"
    },
    {
        "id": "8320",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים עמ' 146-147",
        "date": "17/02"
    },
    {
        "id": "7890",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום משימות בעמוד 61",
        "date": "10/02"
    },
    {
        "id": "8407",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמ' 149",
        "date": "18/02"
    },
    {
        "id": "7860",
        "grade": 3,
        "subject": "תורה",
        "task": "בשבוע הבא יתקיים מבחן - פרקים כח, כט, לא",
        "date": "09/02"
    },
    {
        "id": "7861",
        "grade": 3,
        "subject": "תורה",
        "task": "בשבוע הבא יתקיים מבחן - פרקים כח, כט, לא",
        "date": "09/02"
    },
    {
        "id": "7886",
        "grade": 3,
        "subject": "תרבות ישראל",
        "task": "סיום משימות בעמוד 61",
        "date": "10/02"
    },
    {
        "id": "8345",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 92, 94(1)",
        "date": "17/02"
    },
    {
        "id": "8060",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "במחברת",
        "date": "12/02"
    },
    {
        "id": "8248",
        "grade": 5,
        "subject": "מדעים",
        "task": "294-295",
        "date": "16/02"
    },
    {
        "id": "7795",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "63-67",
        "date": "08/02"
    },
    {
        "id": "8181",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "81-83",
        "date": "15/02"
    },
    {
        "id": "8344",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "84-87",
        "date": "17/02"
    },
    {
        "id": "8295",
        "grade": 5,
        "subject": "תנ\"ך - גיאוגרפיה",
        "task": "עמודים 206-207",
        "date": "17/02"
    }
];