const homeworkData = [
    {
        "id": "3530",
        "grade": 3,
        "subject": "אנגלית",
        "task": "כתיבת האות c  במחברת  עמוד שלם של אות גדולה ואות קטנה",
        "date": "16/11"
    },
    {
        "id": "3589",
        "grade": 3,
        "subject": "אנגלית",
        "task": "187",
        "date": "17/11"
    },
    {
        "id": "7005",
        "grade": 3,
        "subject": "אנגלית",
        "task": "193",
        "date": "25/01"
    },
    {
        "id": "860",
        "grade": 3,
        "subject": "בשבילי המורשת",
        "task": "כתיבה במחברת",
        "date": "16/09"
    },
    {
        "id": "1530",
        "grade": 3,
        "subject": "בשבילי המורשת",
        "task": "השלמת דף תצפית - בדרך חזרה מבית הספר",
        "date": "30/09"
    },
    {
        "id": "1983",
        "grade": 3,
        "subject": "בשבילי המורשת",
        "task": "הכנת כרטיס תושב להגשה על דף - בכתב יד ברור או במחשב",
        "date": "21/10"
    },
    {
        "id": "918",
        "grade": 3,
        "subject": "הנדסה",
        "task": "לסיים את עמוד 13 בחוברת, יש להביא מארז אביזרים לכל שיעור",
        "date": "17/09"
    },
    {
        "id": "1577",
        "grade": 3,
        "subject": "הנדסה",
        "task": "סיום עמ' 14-15",
        "date": "15/10"
    },
    {
        "id": "2458",
        "grade": 3,
        "subject": "הנדסה",
        "task": "עמ' 18 - למי שלא סיים",
        "date": "29/10"
    },
    {
        "id": "3738",
        "grade": 3,
        "subject": "הנדסה",
        "task": "עמ' 22",
        "date": "19/11"
    },
    {
        "id": "4147",
        "grade": 3,
        "subject": "הנדסה",
        "task": "עמוד 24",
        "date": "26/11"
    },
    {
        "id": "4564",
        "grade": 3,
        "subject": "הנדסה",
        "task": "נא לשלים את עמוד 24 - שיעורי בית משבוע עבר - מי שלא עשה.\nבשבוע הבא יתקיים בוחן על הגדרת סוגי הזוויות ושרטוטן. לדוגמא: זוית חדה היא זוית מקטנה מ 90 מעלות - נדרש גם שרטוט מתאי",
        "date": "03/12"
    },
    {
        "id": "5001",
        "grade": 3,
        "subject": "הנדסה",
        "task": "מי שלא סיים - יש לסיים עד עמוד 28 כולל",
        "date": "10/12"
    },
    {
        "id": "5367",
        "grade": 3,
        "subject": "הנדסה",
        "task": "לסיים עמ' 34",
        "date": "24/12"
    },
    {
        "id": "5659",
        "grade": 3,
        "subject": "הנדסה",
        "task": "יש להביא לשיעור מארז אביזרים כולל אוסף זוויות",
        "date": "30/12"
    },
    {
        "id": "6107",
        "grade": 3,
        "subject": "הנדסה",
        "task": "סיום עמ' 42",
        "date": "07/01"
    },
    {
        "id": "7984",
        "grade": 3,
        "subject": "הנדסה",
        "task": "סיום עמ' 91",
        "date": "11/02"
    },
    {
        "id": "8392",
        "grade": 3,
        "subject": "הנדסה",
        "task": "לגזור מעמוד 207 - דף מצולעים לגזירה לפרק מרובעים",
        "date": "18/02"
    },
    {
        "id": "8795",
        "grade": 3,
        "subject": "הנדסה",
        "task": "יש לגזור את המשולשים והמרובעים מעמוד 207 כפי שביקשתי בשיעור קודם ולהדביקם בעמוד 95. ",
        "date": "25/02"
    },
    {
        "id": "106",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים במחברת את המשימות",
        "date": "03/09"
    },
    {
        "id": "718",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 4-6",
        "date": "14/09"
    },
    {
        "id": "719",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 4-6",
        "date": "14/09"
    },
    {
        "id": "739",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 12 כולל",
        "date": "15/09"
    },
    {
        "id": "1133",
        "grade": 3,
        "subject": "חשבון",
        "task": "עבדנו בעמוד 111-112 - נא להביא לכל שיעור מארז אביזרים.",
        "date": "21/09"
    },
    {
        "id": "1135",
        "grade": 3,
        "subject": "חשבון",
        "task": "עבדנו בעמוד 111-112 - נא להביא לכל שיעור מארז אביזרים.",
        "date": "21/09"
    },
    {
        "id": "1400",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמוד 14-15",
        "date": "28/09"
    },
    {
        "id": "1427",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 16-18 למי שלא סיים",
        "date": "29/09"
    },
    {
        "id": "1587",
        "grade": 3,
        "subject": "חשבון",
        "task": "לפתור במחברת את החזרה למבחן",
        "date": "15/10"
    },
    {
        "id": "1815",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום עמ' 113-118",
        "date": "19/10"
    },
    {
        "id": "1853",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 23-25",
        "date": "20/10"
    },
    {
        "id": "2300",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 129-131",
        "date": "27/10"
    },
    {
        "id": "2462",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 29-30",
        "date": "29/10"
    },
    {
        "id": "2707",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 35",
        "date": "02/11"
    },
    {
        "id": "2708",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 135-137.\nלמחר - יש לפרק משטחים מתוך מארז האביזרים - עמ' 5-8 ולהביאם לשיעור",
        "date": "02/11"
    },
    {
        "id": "2733",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 41-42",
        "date": "03/11"
    },
    {
        "id": "2902",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד 142",
        "date": "05/11"
    },
    {
        "id": "3181",
        "grade": 3,
        "subject": "חשבון",
        "task": "חזרה למבחן - לסיים במחברת",
        "date": "10/11"
    },
    {
        "id": "3594",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד 56",
        "date": "17/11"
    },
    {
        "id": "3739",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 150",
        "date": "19/11"
    },
    {
        "id": "4449",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום עד עמ' 165 כולל",
        "date": "01/12"
    },
    {
        "id": "5203",
        "grade": 3,
        "subject": "חשבון",
        "task": "לאחר חנוכה מבדק כפל - כפולות 2,3,4,5,6,7,8",
        "date": "14/12"
    },
    {
        "id": "5232",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד 174",
        "date": "15/12"
    },
    {
        "id": "5368",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 33-34 למי שלא סיים",
        "date": "24/12"
    },
    {
        "id": "5590",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום העמ' עד 85 כולל",
        "date": "28/12"
    },
    {
        "id": "5730",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד 190 - מי שלא סיים",
        "date": "31/12"
    },
    {
        "id": "5970",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 204- ילדים שסיימו השאירו את החוברת בכיתה. \nנא להביא מחר את חוברת 7 שתישאר בכיתה וכן את חוברת 8 .",
        "date": "05/01"
    },
    {
        "id": "6674",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום משימות בכיתה עד עמ' 89 כולל - מי שלא סיים",
        "date": "19/01"
    },
    {
        "id": "7031",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 41 ",
        "date": "25/01"
    },
    {
        "id": "7032",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 41 ",
        "date": "25/01"
    },
    {
        "id": "7417",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 47 כולל.",
        "date": "01/02"
    },
    {
        "id": "7433",
        "grade": 3,
        "subject": "חשבון",
        "task": "להשלים עד 109 - מי שלא סיים + עמוד 105",
        "date": "02/02"
    },
    {
        "id": "7605",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד 113",
        "date": "04/02"
    },
    {
        "id": "7804",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 54",
        "date": "08/02"
    },
    {
        "id": "7805",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמוד 54",
        "date": "08/02"
    },
    {
        "id": "7823",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 117",
        "date": "09/02"
    },
    {
        "id": "8007",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום עמ' 121-122",
        "date": "11/02"
    },
    {
        "id": "8227",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 127",
        "date": "16/02"
    },
    {
        "id": "8404",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 33",
        "date": "18/02"
    },
    {
        "id": "8634",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 63",
        "date": "23/02"
    },
    {
        "id": "8822",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום עמ '135-136",
        "date": "25/02"
    },
    {
        "id": "9046",
        "grade": 3,
        "subject": "חשבון",
        "task": "עמ' 141-142",
        "date": "08/03"
    },
    {
        "id": "9091",
        "grade": 3,
        "subject": "חשבון",
        "task": "דף עבודה",
        "date": "09/03"
    },
    {
        "id": "780",
        "grade": 3,
        "subject": "כתיבה",
        "task": "סיום דף עבודה.",
        "date": "15/09"
    },
    {
        "id": "2938",
        "grade": 3,
        "subject": "כתיבה",
        "task": "סיום כתיבת המשפטים - מצורף צילום לוח",
        "date": "05/11"
    },
    {
        "id": "4593",
        "grade": 3,
        "subject": "כתיבה",
        "task": "סיום כתיבת הסיפור- עמ '29",
        "date": "03/12"
    },
    {
        "id": "5373",
        "grade": 3,
        "subject": "כתיבה",
        "task": "לשיעור זה יש צורך במחברת ספירלה גדולה נפרדת",
        "date": "24/12"
    },
    {
        "id": "8030",
        "grade": 3,
        "subject": "כתיבה",
        "task": "דפי עבודה בנושא משפחות מילים שניתנו כמשימה הנוספת בשיעור.",
        "date": "11/02"
    },
    {
        "id": "8852",
        "grade": 3,
        "subject": "כתיבה",
        "task": "מי שלא סיים  -יש להביא לי לבדיקה ביום שישי.",
        "date": "25/02"
    },
    {
        "id": "617",
        "grade": 3,
        "subject": "לשון",
        "task": "תרגול במחברת",
        "date": "12/09"
    },
    {
        "id": "621",
        "grade": 3,
        "subject": "לשון",
        "task": "תרגול במחברת",
        "date": "12/09"
    },
    {
        "id": "1069",
        "grade": 3,
        "subject": "לשון",
        "task": "משימה במחברת - מצב\" צילום המשימה- סידור מילים לפי סדר א\"ב חיצוני ופנימי",
        "date": "19/09"
    },
    {
        "id": "1699",
        "grade": 3,
        "subject": "לשון",
        "task": "סיום משימות במחברת - מצ\"ב צילום",
        "date": "17/10"
    },
    {
        "id": "2360",
        "grade": 3,
        "subject": "לשון",
        "task": "לסיים דף עבודה ולהביא למחר.",
        "date": "27/10"
    },
    {
        "id": "4324",
        "grade": 3,
        "subject": "לשון",
        "task": "בשבוע הבר יתקיים בוחן קצר אך ורק על סידור מילים",
        "date": "28/11"
    },
    {
        "id": "4863",
        "grade": 3,
        "subject": "לשון",
        "task": "עמ' 33 - סיום שאלה 3",
        "date": "08/12"
    },
    {
        "id": "6356",
        "grade": 3,
        "subject": "לשון",
        "task": "בחרו 3 מילים שפירשנו מתוך הטקסט וחברו משפט לכל מילה.",
        "date": "12/01"
    },
    {
        "id": "7481",
        "grade": 3,
        "subject": "לשון",
        "task": "עמ' 54  - משימה 1",
        "date": "02/02"
    },
    {
        "id": "7721",
        "grade": 3,
        "subject": "לשון",
        "task": "סיום עמודים 45-47 משימות 1-3",
        "date": "06/02"
    },
    {
        "id": "8534",
        "grade": 3,
        "subject": "לשון",
        "task": "סיום עמ '68-69",
        "date": "20/02"
    },
    {
        "id": "631",
        "grade": 3,
        "subject": "מדעים",
        "task": "חומר ותכונה- היום התחלנו ללמוד על חומרים. התחלנו עם תכונות החומר, למדנו מהי תכונה ושוחחנו על דוגמאות מהסביבה שלנו.\nמשימה משיעור שעבר (לתלמידים שלא עשו): רשימה של 10 מוצרים בבית או בסביבה. לכל מוצר לרשום ממה הוא עשוי- מה החומר שלו. לדוגמה: חלון- פלסטיק/זכוכית ומתכת.\n\nבנוסף, עמוד 9 בחוברת. לענות על התשובות במחברת מדעים. \nיש להקפיד להביא מחברת וחוברת לכל שיעור.",
        "date": "12/09"
    },
    {
        "id": "707",
        "grade": 3,
        "subject": "מדעים",
        "task": "שיעורי בית עמוד 9. ",
        "date": "14/09"
    },
    {
        "id": "1096",
        "grade": 3,
        "subject": "מדעים",
        "task": "מי שלא הספיק בכיתה-עמוד 12-13 לענות על השאלות",
        "date": "19/09"
    },
    {
        "id": "3261",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 12, 18 למי שלא סיים.\nעמוד21 שאלות 1-3.\nהמשך הטבלה במחברת.",
        "date": "11/11"
    },
    {
        "id": "3702",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 27-28 מע שלא סיים שאלות 1-8. משיעור שעבר.\nעמוד 35 לסיים אפיוני מוצר.\nעמוד 33 להגשה ליום שישי.",
        "date": "18/11"
    },
    {
        "id": "3974",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 36-37 מי שלא הספיק לסיים בכיתה",
        "date": "23/11"
    },
    {
        "id": "4339",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 54 שאלות 1-2",
        "date": "28/11"
    },
    {
        "id": "4411",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 55-56",
        "date": "30/11"
    },
    {
        "id": "4516",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 59 שאלות 1-3",
        "date": "02/12"
    },
    {
        "id": "4728",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 59-60 שאלות 1-7. )1-3 עשינו כבר)",
        "date": "05/12"
    },
    {
        "id": "4786",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 63 שאלות 1-2",
        "date": "07/12"
    },
    {
        "id": "4921",
        "grade": 3,
        "subject": "מדעים",
        "task": "לכל התלמידים שלא הגישו עבודה- הזדמנות אחרונה להגשת עבודה עם ציון. עמוד 47 שאלה 2 סעיפים א-ו. עד יום שישי 12.12.",
        "date": "09/12"
    },
    {
        "id": "5569",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 67 שאלות 1-2",
        "date": "28/12"
    },
    {
        "id": "5951",
        "grade": 3,
        "subject": "מדעים",
        "task": "התלמידים קיבלו את המבחנים בחזרה",
        "date": "04/01"
    },
    {
        "id": "6286",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 70שאלה 1",
        "date": "11/01"
    },
    {
        "id": "6959",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמודים 78-79 \nשאלות 1-2 בעמוד 78 )רשימה של 10 מוצרי חשמל ולאיזו מטרה משתמשים בו?",
        "date": "23/01"
    },
    {
        "id": "7409",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 86- טבלה במחברת (השערה בלבד!) איזה חומר סוגר/לא סוגר מעגל חשמלי",
        "date": "01/02"
    },
    {
        "id": "7915",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 87. שאלות 1-3 מי שלא הספיק בכיתה.\nעמוד 94- שאלות 4 ו5 בלבד.",
        "date": "10/02"
    },
    {
        "id": "8327",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 96-97 ",
        "date": "17/02"
    },
    {
        "id": "8981",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 107 שאלות 1-4 לענות במחברת. ליום שישי",
        "date": "27/02"
    },
    {
        "id": "1659",
        "grade": 3,
        "subject": "מולדת",
        "task": "הגשת עבודה, לתלמיד שלא הגיש. ע\"מ 18 משימה 1,2",
        "date": "16/10"
    },
    {
        "id": "8314",
        "grade": 3,
        "subject": "מולדת",
        "task": "שרטט את החדר שלך לפי הנלמד",
        "date": "17/02"
    },
    {
        "id": "3457",
        "grade": 3,
        "subject": "ספרות",
        "task": "משימה בנושא באתר אופק - משימת חובה לביצוע עד יום שישי הבא.",
        "date": "14/11"
    },
    {
        "id": "1537",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים שאלות 1-4בעמוד 80",
        "date": "30/09"
    },
    {
        "id": "2431",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום עמ' 15, שאלות 1-3",
        "date": "28/10"
    },
    {
        "id": "2432",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום עמ' 15, שאלות 1-3",
        "date": "28/10"
    },
    {
        "id": "4137",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים את הדבקת המילים ופירושן במחברת - חובה לשיעור מחר\nבחירת 3 מילים וכתיבת משפט - לכל מילה משפט נפרד",
        "date": "25/11"
    },
    {
        "id": "4138",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים את הדבקת המילים ופירושן במחברת - חובה לשיעור מחר\nבחירת 3 מילים וכתיבת משפט - לכל מילה משפט נפרד",
        "date": "25/11"
    },
    {
        "id": "6077",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום המשימות בעמוד 41",
        "date": "06/01"
    },
    {
        "id": "6078",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום המשימות בעמוד 41",
        "date": "06/01"
    },
    {
        "id": "7155",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "יש לסיים את עמוד 50 - לכתוב מכתב ולהביא אותו בבקבוק פלסטיק חד פעמי לכיתה - למחר.",
        "date": "27/01"
    },
    {
        "id": "7156",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "יש לסיים את עמוד 50 - לכתוב מכתב ולהביא אותו בבקבוק פלסטיק חד פעמי לכיתה - למחר.",
        "date": "27/01"
    },
    {
        "id": "7582",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "יש לסיים עד עמוד 57 שאלה 7 כולל.",
        "date": "03/02"
    },
    {
        "id": "7583",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "יש לסיים עד עמוד 57 שאלה 7 כולל.",
        "date": "03/02"
    },
    {
        "id": "7955",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום עמוד 63",
        "date": "10/02"
    },
    {
        "id": "7956",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום עמוד 63",
        "date": "10/02"
    },
    {
        "id": "8319",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים עמ' 146-147",
        "date": "17/02"
    },
    {
        "id": "8320",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "לסיים עמ' 146-147",
        "date": "17/02"
    },
    {
        "id": "137",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף עבודה",
        "date": "03/09"
    },
    {
        "id": "375",
        "grade": 3,
        "subject": "שפה",
        "task": "עמוד 7 - מענה במחברת, שאלות 1-3 מי שלא סיים",
        "date": "08/09"
    },
    {
        "id": "1590",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמ' 75-76 בחוברת",
        "date": "15/10"
    },
    {
        "id": "1762",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמוד 13 למי שלא סיים. ",
        "date": "19/10"
    },
    {
        "id": "1763",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמוד 13 למי שלא סיים. ",
        "date": "19/10"
    },
    {
        "id": "2043",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום הדף בבית - מי שלא סיים. להביא לי ביום שישי.",
        "date": "22/10"
    },
    {
        "id": "2476",
        "grade": 3,
        "subject": "שפה",
        "task": "עמ' 17 מי שלא סיים",
        "date": "29/10"
    },
    {
        "id": "2911",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף העבודה",
        "date": "05/11"
    },
    {
        "id": "3211",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמ' 18-19",
        "date": "10/11"
    },
    {
        "id": "3637",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום מיון המילים לקטגוריות השונות",
        "date": "17/11"
    },
    {
        "id": "4879",
        "grade": 3,
        "subject": "שפה",
        "task": "עמ' 33 - סיום שאלה 3",
        "date": "08/12"
    },
    {
        "id": "4911",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום השאלה במחברת - מה למדתי חדש - הטקסט נשלח לבית",
        "date": "09/12"
    },
    {
        "id": "5527",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום שאלות במחברת - חלק 4 ואחרון בטקסט.\n1. מדוע העננים חשובים?\n2. מדוע לילות שבהם השמים אינם מעוננים קרים יותר מלילות שבהם השמים מעוננים?",
        "date": "28/12"
    },
    {
        "id": "5873",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום המשימות עד עמ' 38 משימה 7 כולל במחברת",
        "date": "02/01"
    },
    {
        "id": "6821",
        "grade": 3,
        "subject": "שפה",
        "task": "משימה נוספת במחברת - כתבו 5 מילים מתארות למילה מסע.",
        "date": "21/01"
    },
    {
        "id": "6977",
        "grade": 3,
        "subject": "שפה",
        "task": "ש\"ב במחברת: כתבו מעל כל משפט מה הסיבה ומה התוצאה:\n1. לא שתיתי מים ולכן כאב לי הראש.\n2. הלכתי לישון מאוחר ואיחרתי לבית הספר.\n3. נפלתי מהאופניים כי רכבתי מהר.\n4. לא הרגשתי טוב ולכן שתיתי תרופה.",
        "date": "25/01"
    },
    {
        "id": "6978",
        "grade": 3,
        "subject": "שפה",
        "task": "ש\"ב במחברת: כתבו מעל כל משפט מה הסיבה ומה התוצאה:\n1. לא שתיתי מים ולכן כאב לי הראש.\n2. הלכתי לישון מאוחר ואיחרתי לבית הספר.\n3. נפלתי מהאופניים כי רכבתי מהר.\n4. לא הרגשתי טוב ולכן שתיתי תרופה.",
        "date": "25/01"
    },
    {
        "id": "7224",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמוד 52 שאלות 1-3",
        "date": "28/01"
    },
    {
        "id": "7370",
        "grade": 3,
        "subject": "שפה",
        "task": "יש לסיים את השאלות המצורפת במחברת - מחר אאסוף מחברות לבדיקה",
        "date": "01/02"
    },
    {
        "id": "7371",
        "grade": 3,
        "subject": "שפה",
        "task": "יש לסיים את השאלות המצורפת במחברת - מחר אאסוף מחברות לבדיקה",
        "date": "01/02"
    },
    {
        "id": "7890",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום משימות בעמוד 61",
        "date": "10/02"
    },
    {
        "id": "8407",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמ' 149",
        "date": "18/02"
    },
    {
        "id": "8834",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף עבודה בנושא המגילה - להחזיר לבדיקה ביום שישי",
        "date": "25/02"
    },
    {
        "id": "9045",
        "grade": 3,
        "subject": "שפה",
        "task": "עמ' 90-91-משימות 1-6",
        "date": "08/03"
    },
    {
        "id": "9090",
        "grade": 3,
        "subject": "שפה",
        "task": "משימות בקובץ שנשלח להורים",
        "date": "09/03"
    },
    {
        "id": "9336",
        "grade": 3,
        "subject": "שפה",
        "task": "הכנת ת.ז לפרח/בעל חיים באביב - נשלח קובץ",
        "date": "15/03"
    },
    {
        "id": "373",
        "grade": 3,
        "subject": "תורה",
        "task": "משימות במחברת",
        "date": "08/09"
    },
    {
        "id": "7084",
        "grade": 3,
        "subject": "תורה",
        "task": "מבחן יתקיים ב 16.2.26",
        "date": "26/01"
    },
    {
        "id": "7085",
        "grade": 3,
        "subject": "תורה",
        "task": "מבחן יתקיים ב 16.2.26",
        "date": "26/01"
    },
    {
        "id": "7860",
        "grade": 3,
        "subject": "תורה",
        "task": "בשבוע הבא יתקיים מבחן - פרקים כח, כט, לא",
        "date": "09/02"
    },
    {
        "id": "7861",
        "grade": 3,
        "subject": "תורה",
        "task": "בשבוע הבא יתקיים מבחן - פרקים כח, כט, לא",
        "date": "09/02"
    },
    {
        "id": "8676",
        "grade": 3,
        "subject": "תורה",
        "task": "1. לאן ציווה ה'? על יעקב ללכת ומה הוא ביקש ממנו לבנות שם?\n2. מה יעקב ביקש מבני ביתו לעושת לפני שהלכו לבית אל?\n3. מה עשה יעקב עם כל הפסלים והתכשיטים?\n4. איך קרא יעקב למקום ומדוע?",
        "date": "23/02"
    },
    {
        "id": "8677",
        "grade": 3,
        "subject": "תורה",
        "task": "1. לאן ציווה ה'? על יעקב ללכת ומה הוא ביקש ממנו לבנות שם?\n2. מה יעקב ביקש מבני ביתו לעושת לפני שהלכו לבית אל?\n3. מה עשה יעקב עם כל הפסלים והתכשיטים?\n4. איך קרא יעקב למקום ומדוע?",
        "date": "23/02"
    },
    {
        "id": "1480",
        "grade": 3,
        "subject": "תרבות ישראל",
        "task": "סיום משימות בעמוד 6-7 - בחירת אחת האגדות וכתיבת תשובות במחברת",
        "date": "30/09"
    },
    {
        "id": "2387",
        "grade": 3,
        "subject": "תרבות ישראל",
        "task": "לסיים עמ' 12 שאלות 1-5",
        "date": "28/10"
    },
    {
        "id": "6029",
        "grade": 3,
        "subject": "תרבות ישראל",
        "task": "סיום שאלה 4 במחברת - כתבו על מקרה בו עזרתם לחבר או קיבלתם עזרה מחבר",
        "date": "06/01"
    },
    {
        "id": "7886",
        "grade": 3,
        "subject": "תרבות ישראל",
        "task": "סיום משימות בעמוד 61",
        "date": "10/02"
    },
    {
        "id": "709",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 6, 7",
        "date": "14/09"
    },
    {
        "id": "840",
        "grade": 5,
        "subject": "אנגלית",
        "task": "p. 15, ex, 10 - להשלים במחברת",
        "date": "16/09"
    },
    {
        "id": "1030",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 10-11, ללמוד מילים חדשות",
        "date": "18/09"
    },
    {
        "id": "1358",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 13-14",
        "date": "28/09"
    },
    {
        "id": "1967",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 16-18",
        "date": "21/10"
    },
    {
        "id": "2135",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 19-20",
        "date": "23/10"
    },
    {
        "id": "2566",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 21, 22,23",
        "date": "30/10"
    },
    {
        "id": "3265",
        "grade": 5,
        "subject": "אנגלית",
        "task": "אתר  גלים",
        "date": "11/11"
    },
    {
        "id": "3421",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 29-30\nלהשלים עמ' 24-27 בחוברת עבודה",
        "date": "13/11"
    },
    {
        "id": "4122",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 38-40",
        "date": "25/11"
    },
    {
        "id": "4422",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 41-45",
        "date": "30/11"
    },
    {
        "id": "4784",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 50-51",
        "date": "07/12"
    },
    {
        "id": "5071",
        "grade": 5,
        "subject": "אנגלית",
        "task": "משימות באתר גלים",
        "date": "11/12"
    },
    {
        "id": "5197",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 53-54",
        "date": "14/12"
    },
    {
        "id": "5585",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 58-60(4)",
        "date": "28/12"
    },
    {
        "id": "5710",
        "grade": 5,
        "subject": "אנגלית",
        "task": "משימה באתר גלים",
        "date": "30/12"
    },
    {
        "id": "5836",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 61-63",
        "date": "01/01"
    },
    {
        "id": "6044",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 64-65",
        "date": "06/01"
    },
    {
        "id": "6188",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 64, 65, 66, ex. 4",
        "date": "08/01"
    },
    {
        "id": "6409",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 66-68",
        "date": "13/01"
    },
    {
        "id": "7030",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 74-76",
        "date": "25/01"
    },
    {
        "id": "7256",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 79-80",
        "date": "29/01"
    },
    {
        "id": "7546",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 83,84",
        "date": "03/02"
    },
    {
        "id": "8345",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 92, 94(1)",
        "date": "17/02"
    },
    {
        "id": "8729",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 96",
        "date": "24/02"
    },
    {
        "id": "9061",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 104-105",
        "date": "08/03"
    },
    {
        "id": "159",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "2 שאלות במחברת",
        "date": "04/09"
    },
    {
        "id": "1000",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "משימה במחברת",
        "date": "18/09"
    },
    {
        "id": "2103",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "18-20",
        "date": "23/10"
    },
    {
        "id": "2525",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "במחברת",
        "date": "30/10"
    },
    {
        "id": "4251",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "במחברת",
        "date": "27/11"
    },
    {
        "id": "4656",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "בחוברת + משימות באתר גלים",
        "date": "04/12"
    },
    {
        "id": "5806",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "בחוברת עמודים 24-33 כולל",
        "date": "01/01"
    },
    {
        "id": "6870",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "34-35- חקירת מקביליות מיוחדות",
        "date": "22/01"
    },
    {
        "id": "8060",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "במחברת",
        "date": "12/02"
    },
    {
        "id": "8458",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "36-41",
        "date": "19/02"
    },
    {
        "id": "2112",
        "grade": 5,
        "subject": "לשון",
        "task": "ע\"מ 29",
        "date": "23/10"
    },
    {
        "id": "2536",
        "grade": 5,
        "subject": "לשון",
        "task": "ע\"מ 31",
        "date": "30/10"
    },
    {
        "id": "378",
        "grade": 5,
        "subject": "מדעים",
        "task": "עמוד 10 שאלו 1-2 סעיפים א'-ד' ",
        "date": "08/09"
    },
    {
        "id": "8248",
        "grade": 5,
        "subject": "מדעים",
        "task": "294-295",
        "date": "16/02"
    },
    {
        "id": "4102",
        "grade": 5,
        "subject": "מחשבים",
        "task": "חשיבה על נושא לכרזה לשבוע הבא - הכנת בדף כתוב - תכנון התוצר: הצלת בע\"ח/זהירות בדרכים/איכות הסביבה/אלימות ועוד",
        "date": "25/11"
    },
    {
        "id": "7543",
        "grade": 5,
        "subject": "מחשבים",
        "task": "יש להביא לשיעור זה דיסק און קי באופן קבוע.",
        "date": "03/02"
    },
    {
        "id": "134",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "110-113 כולל",
        "date": "03/09"
    },
    {
        "id": "214",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "114-115",
        "date": "05/09"
    },
    {
        "id": "271",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "116-118 + שתי שאלות במחברת",
        "date": "07/09"
    },
    {
        "id": "446",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "121-123",
        "date": "09/09"
    },
    {
        "id": "513",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "124-126 , 137-138",
        "date": "10/09"
    },
    {
        "id": "629",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "143, 146, 150 בחוברת + 5 תרגילים במחברת",
        "date": "12/09"
    },
    {
        "id": "699",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "139-142 + להשלים במחברת תרגילים שלא פתרנו יחד",
        "date": "14/09"
    },
    {
        "id": "871",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "127-130",
        "date": "16/09"
    },
    {
        "id": "1092",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "134-136",
        "date": "19/09"
    },
    {
        "id": "1142",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "143-147",
        "date": "21/09"
    },
    {
        "id": "1703",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "במחברת + בחוברת עמודים 5-9",
        "date": "17/10"
    },
    {
        "id": "1783",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "12-15",
        "date": "19/10"
    },
    {
        "id": "1981",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "16-19",
        "date": "21/10"
    },
    {
        "id": "2174",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "20, 32-33",
        "date": "24/10"
    },
    {
        "id": "2291",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "24-26 , 35-36",
        "date": "26/10"
    },
    {
        "id": "2505",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "27-31",
        "date": "29/10"
    },
    {
        "id": "2681",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "42-47 + משימה במחברת",
        "date": "02/11"
    },
    {
        "id": "2871",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "עמודים 159-160- להעתיק למחברת ולפתור עם דרך פתרון מפורטת ",
        "date": "04/11"
    },
    {
        "id": "3068",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "159-160 , 103-105",
        "date": "05/11"
    },
    {
        "id": "3126",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "50-54 כולל",
        "date": "09/11"
    },
    {
        "id": "3364",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "61-63 , 66",
        "date": "12/11"
    },
    {
        "id": "3524",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת עד עמוד 77 כולל",
        "date": "16/11"
    },
    {
        "id": "4134",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "78-82",
        "date": "25/11"
    },
    {
        "id": "4205",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "במחברת",
        "date": "26/11"
    },
    {
        "id": "4335",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "86-88",
        "date": "28/11"
    },
    {
        "id": "4391",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "89-93",
        "date": "30/11"
    },
    {
        "id": "5321",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "170-177",
        "date": "23/12"
    },
    {
        "id": "5402",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "179-183",
        "date": "24/12"
    },
    {
        "id": "5703",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "184-187",
        "date": "30/12"
    },
    {
        "id": "5810",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "187-191",
        "date": "31/12"
    },
    {
        "id": "6297",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "4-7",
        "date": "11/01"
    },
    {
        "id": "6422",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "8-13",
        "date": "13/01"
    },
    {
        "id": "6559",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "8-13",
        "date": "14/01"
    },
    {
        "id": "6633",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "18-24 כולל",
        "date": "18/01"
    },
    {
        "id": "6850",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת",
        "date": "21/01"
    },
    {
        "id": "6952",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "בחוברת",
        "date": "23/01"
    },
    {
        "id": "7016",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "41-45",
        "date": "25/01"
    },
    {
        "id": "7241",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "במחברת",
        "date": "28/01"
    },
    {
        "id": "7795",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "63-67",
        "date": "08/02"
    },
    {
        "id": "8181",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "81-83",
        "date": "15/02"
    },
    {
        "id": "8344",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "84-87",
        "date": "17/02"
    },
    {
        "id": "9193",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "עמוד 96 שאלה 35 ",
        "date": "10/03"
    },
    {
        "id": "9542",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "98-99",
        "date": "19/03"
    },
    {
        "id": "3709",
        "grade": 5,
        "subject": "שפה",
        "task": "עמוד 94 שאלות 1-7",
        "date": "18/11"
    },
    {
        "id": "5153",
        "grade": 5,
        "subject": "שפה",
        "task": "עמוד 95-96",
        "date": "14/12"
    },
    {
        "id": "5154",
        "grade": 5,
        "subject": "שפה",
        "task": "עמוד 95-96",
        "date": "14/12"
    },
    {
        "id": "6606",
        "grade": 5,
        "subject": "שפה",
        "task": "110-113",
        "date": "18/01"
    },
    {
        "id": "6607",
        "grade": 5,
        "subject": "שפה",
        "task": "110-113",
        "date": "18/01"
    },
    {
        "id": "9574",
        "grade": 5,
        "subject": "שפה",
        "task": "משימה בגלים",
        "date": "22/03"
    },
    {
        "id": "9575",
        "grade": 5,
        "subject": "שפה",
        "task": "משימה בגלים",
        "date": "22/03"
    },
    {
        "id": "8295",
        "grade": 5,
        "subject": "תנ\"ך - גיאוגרפיה",
        "task": "עמודים 206-207",
        "date": "17/02"
    }
];