const homeworkData = [
    {
        "id": "9091",
        "grade": 3,
        "subject": "חשבון",
        "task": "דף עבודה",
        "date": "09/03"
    },
    {
        "id": "9090",
        "grade": 3,
        "subject": "שפה",
        "task": "משימות בקובץ שנשלח להורים",
        "date": "09/03"
    },
    {
        "id": "9336",
        "grade": 3,
        "subject": "שפה",
        "task": "הכנת ת.ז לפרח/בעל חיים באביב - נשלח קובץ",
        "date": "15/03"
    },
    {
        "id": "9193",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "עמוד 96 שאלה 35 ",
        "date": "10/03"
    },
    {
        "id": "9542",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "98-99",
        "date": "19/03"
    }
];