const homeworkData = [
    {
        "id": "9769",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 71 כולל",
        "date": "12/04"
    },
    {
        "id": "9770",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 71 כולל",
        "date": "12/04"
    },
    {
        "id": "9839",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 150",
        "date": "13/04"
    },
    {
        "id": "9921",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום שאלה 2 בלבד",
        "date": "14/04"
    },
    {
        "id": "9922",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום שאלה 2 בלבד",
        "date": "14/04"
    },
    {
        "id": "9336",
        "grade": 3,
        "subject": "שפה",
        "task": "הכנת ת.ז לפרח/בעל חיים באביב - נשלח קובץ",
        "date": "15/03"
    },
    {
        "id": "9542",
        "grade": 5,
        "subject": "מתמטיקה",
        "task": "98-99",
        "date": "19/03"
    },
    {
        "id": "9574",
        "grade": 5,
        "subject": "שפה",
        "task": "משימה בגלים",
        "date": "22/03"
    },
    {
        "id": "9575",
        "grade": 5,
        "subject": "שפה",
        "task": "משימה בגלים",
        "date": "22/03"
    }
];