const homeworkData = [
    {
        "id": "8795",
        "grade": 3,
        "subject": "הנדסה",
        "task": "יש לגזור את המשולשים והמרובעים מעמוד 207 כפי שביקשתי בשיעור קודם ולהדביקם בעמוד 95. ",
        "date": "25/02"
    },
    {
        "id": "8822",
        "grade": 3,
        "subject": "חשבון",
        "task": "סיום עמ '135-136",
        "date": "25/02"
    },
    {
        "id": "8852",
        "grade": 3,
        "subject": "כתיבה",
        "task": "מי שלא סיים  -יש להביא לי לבדיקה ביום שישי.",
        "date": "25/02"
    },
    {
        "id": "8981",
        "grade": 3,
        "subject": "מדעים",
        "task": "עמוד 107 שאלות 1-4 לענות במחברת. ליום שישי",
        "date": "27/02"
    },
    {
        "id": "8834",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום דף עבודה בנושא המגילה - להחזיר לבדיקה ביום שישי",
        "date": "25/02"
    },
    {
        "id": "8729",
        "grade": 5,
        "subject": "אנגלית",
        "task": "w. b. p. 96",
        "date": "24/02"
    }
];