const homeworkData = [
    {
        "id": "9960",
        "grade": 3,
        "subject": "הנדסה",
        "task": "סיום עמ' 99",
        "date": "15/04"
    },
    {
        "id": "9769",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 71 כולל",
        "date": "12/04"
    },
    {
        "id": "9770",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 71 כולל",
        "date": "12/04"
    },
    {
        "id": "9839",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 150",
        "date": "13/04"
    },
    {
        "id": "9991",
        "grade": 3,
        "subject": "חשבון",
        "task": "לסיים עד עמ' 75 כולל.",
        "date": "15/04"
    },
    {
        "id": "9921",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום שאלה 2 בלבד",
        "date": "14/04"
    },
    {
        "id": "9922",
        "grade": 3,
        "subject": "רוחב/פיצול שפה",
        "task": "סיום שאלה 2 בלבד",
        "date": "14/04"
    },
    {
        "id": "10087",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמ' 229-230 - שאלות 1-5",
        "date": "19/04"
    },
    {
        "id": "10088",
        "grade": 3,
        "subject": "שפה",
        "task": "סיום עמ' 229-230 - שאלות 1-5",
        "date": "19/04"
    },
    {
        "id": "10021",
        "grade": 5,
        "subject": "גיאומטריה",
        "task": "בחוברת 52-53",
        "date": "16/04"
    },
    {
        "id": "9574",
        "grade": 5,
        "subject": "שפה",
        "task": "משימה בגלים",
        "date": "22/03"
    },
    {
        "id": "9575",
        "grade": 5,
        "subject": "שפה",
        "task": "משימה בגלים",
        "date": "22/03"
    }
];